---
kind: type
id: T:Autodesk.Revit.DB.IPerformanceAdviserRule
source: html/8c1a1af9-744f-9831-e8e6-84a44be93ec2.htm
---
# Autodesk.Revit.DB.IPerformanceAdviserRule

Base class to derive specific performance adviser rules from.

## Syntax (C#)
```csharp
public interface IPerformanceAdviserRule
```